docs: login n stuff
